app/Http/Controllers/UsuarioController.php

insert into `usuarios` (`nombre`, `email`, `password`) values ('Fabricio', 'lkjhgfds@gmail.com', '$2y$12$4WxPjsy0RubGq2EPqpRXw.FNvoBlY373fVR9l04mZ4y8fU4.hS1l.')
select * from `usuarios` limit 4 offset 0
select count(*) as aggregate from `usuarios`
---
    public function store(Request $request)
    {
        //dd($request->all());

        $validatedData = $request->validate([
            'nombre' => 'required|string|max:255',
            'email' => 'required|email|unique:usuarios',
            'password' =>'required|string|min:8'
        ]);
        $validatedData['password'] = bcrypt($validatedData['password']);

        Usuarios::create($validatedData);

        $usuarios = Usuarios::paginate(4);

select * from `usuarios` where `usuarios`.`id` = '1' limit 1
---
    public function edit($id){
        //dd($id);
        $usuario = Usuarios::find($id);

select * from `usuarios` where `usuarios`.`id` = '1' limit 1
update `usuarios` set `nombre` = 'Sama' where `id` = 1
---
    public function update(Request $request){
        //dd($request->all());

        $request->validate([
            'nombre' => 'required|string|max:255',
        ]);

        $usuario = Usuarios::find($request->id);

        if ($usuario){
            $usuario->nombre = $request->nombre;
            $usuario->save();

select * from `usuarios` limit 4 offset 0
select count(*) as aggregate from `usuarios`
---
    public function list(){
        $usuarios = Usuarios::paginate(4);